Revit 2026 API

# MaterialCreate Method

---

Creates a new material.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElementId Create(
	Document document,
	string name
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String
) As ElementId
```
```cpp
public:
static ElementId^ Create(
	Document^ document,
	String^ name
)
```
```fsharp
static member Create :
        document : Document *
        name : string -> ElementId
```

#### Parameters

document Document
     The document in which to create the material.
name String
     The name of the new material.

#### Return Value

ElementId Identifier of the new material.

| Exception | Condition |
| --- | --- |
| ArgumentException | name cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a material element name. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Material Class

Autodesk.Revit.DB Namespace